of222/tutorials/rheoFoam/Contraction41/Oldroyd-BLog/constant/constitutiveProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      constitutiveProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

parameters
{               
                type             Oldroyd-BLog;

                rho              rho [1 -3 0 0 0 0 0] 0.01;
                etaS             etaS [1 -1 -1 0 0 0 0] .11111;
                etaP             etaP [1 -1 -1 0 0 0 0] .88889;               
                lambda           lambda [0 0 1 0 0 0 0] 1;

                uTauCoupling     true;               
}

passiveScalarProperties
{
                solvePassiveScalar   off;
                D                    D [ 0 2 -1 0 0 0 0 ] 1e-9; 
}

// ************************************************************************* //
